def area(a, h): 
    """
    Принимает сторону и высоту треугольника и возвращает площадь этого треугольника

      Параметры:
    a (int) : сторона треугольника
    h (int) : высота треугольника

      возвращаемое  значение:
    (a * h)/2 (int) : площадь треугольника
    """
    return a * h / 2 

def perimeter(a, b, c): 
    """
    Принимает 3 стороны треугольника и возвращает периметр этого треугольника

        Параметры:
                a (int) : сторона треугольника
                b (int) : сторона треугольника
    c (int) : сторона треугольника
        возвращаемое  значение:
                a + b + c (int) : площадь треугольника
    """
    return a + b + c
